app/Controllers/Admin/Admin.php

    public function rekap_siswa()
    {
        $absensi = new Absensi();
        $user = new MemberModel();
        $jumlahBaris = 10;
        $currentPage = $this->request->getVar('page_absensi');
        $dataAbsen = $absensi->select('nama_lengkap, nim_nis, nama_instansi, status, waktu_absen')->orderBy('waktu_absen', 'desc')->orderBy('id', 'desc')->where('jenis_user', 'Student')->distinct('nim_nis')->get()->getResult();
        $dataUser = $user->where('jenis_user', 'Student')->orderBy('nama_lengkap', 'asc')->findAll();
---
SELECT DISTINCT `nama_lengkap`, `nim_nis`, `nama_instansi`, `status`, `waktu_absen`
FROM `absensi`
WHERE `jenis_user` = 'Student'
ORDER BY `waktu_absen` DESC, `id` DESC
SELECT *
FROM `member`
WHERE `jenis_user` = 'Student'
ORDER BY `nama_lengkap` ASC